insert into RECompany values
(000, 'Amuse', '경기', '이천', '창전'),
(001, 'Temp', '경기', '광주', '태전'),
(002, 'Riot', '강원', '강릉', '성남'),
(003, 'Blizzard', '충북', '청주', '서원'),
(004, 'Ubisoft', '강원', '원주', '태장'),
(005, 'Naughtydog', '전남', '나주', '성북'),
(006, 'Rockstar', '전북', '군산', '월명'),
(007, 'Electronic', '경북', '구미', '송정'),
(008, 'Arts', '강원', '강릉', '내곡'),
(009, 'Playground', '경북', '경주', '황성'),
(010, 'Epic', '충북', '충주', '연수'),
(011, 'Insomniac', '충북', '청주', '흥덕'),
(012, 'Nexon', '전남', '광양', '금호'),
(013, 'Quantic', '충북', '청주', '상당');

insert into Department values
(0, 'Marketing', 3),
(1, 'Administration', 2),
(2, 'Finanmanage', 1),
(3, 'Custommanage', 2);

insert into Customer values
(000, 'Mayuko', '1991-01-26', '010-5924-5940'),
(001, 'Bezalel', '1985-11-21', '010-5890-2149'),
(002, 'Parto', '1986-08-28', '010-6701-5017'),
(003, 'Chirstian', '1986-12-01', '010-1670-1769'),
(004, 'Kyoichi', '1989-09-12', '010-1073-1055'),
(005, 'Anneke', '1989-06-02', '010-0751-1643'),
(006, 'Tzvetan', '1989-02-10', '010-7968-5182'),
(007, 'Saniya', '1994-09-15', '010-1678-6107'),
(008, 'Sumant', '1985-02-18', '010-1867-1079'),
(009, 'Duangkaew', '1989-08-24', '010-1546-1749'),
(010, 'Patricio', '1992-12-18', '010-0124-9180'),
(011, 'Mary', '1990-01-22', '010-4172-6197'),
(012, 'Eberhardt', '1985-10-20', '010-1469-8145'),
(013, 'Berni', '1987-03-11', '010-8093-0187'),
(014, 'Guoxiang', '1987-07-02', '010-9581-9412'),
(015, 'Kazuhito', '1995-01-27', '010-1607-4716'),
(016, 'Cristinel', '1993-08-03', '010-1860-7819'),
(017, 'Kazuhide', '1987-04-03', '010-2890-8794'),
(018, 'Lillian', '1999-04-30', '010-8590-6012');