insert into RECompany values
(000, 'Amuse', '경기', '이천', '창전'),
(001, 'Temp', '경기', '광주', '태전'),
(002, 'Riot', '강원', '강릉', '성남'),
(003, 'Blizzard', '충북', '청주', '서원'),
(004, 'Ubisoft', '강원', '원주', '태장'),
(005, 'Naughtydog', '전남', '나주', '성북'),
(006, 'Rockstar', '전북', '군산', '월명'),
(007, 'Electronic', '경북', '구미', '송정'),
(008, 'Arts', '강원', '강릉', '내곡'),
(009, 'Playground', '경북', '경주', '황성'),
(010, 'Epic', '충북', '충주', '연수'),
(011, 'Insomniac', '충북', '청주', '흥덕'),
(012, 'Nexon', '전남', '광양', '금호'),
(013, 'Quantic', '충북', '청주', '상당');

insert into Department values
(0, 'Marketing', 3),
(1, 'Administration', 2),
(2, 'Finanmanage', 1),
(3, 'Custommanage', 2);

insert into Customer values
(000, 'Mayuko', '1991-01-26', '010-5924-5940'),
(001, 'Bezalel', '1985-11-21', '010-5890-2149'),
(002, 'Parto', '1986-08-28', '010-6701-5017'),
(003, 'Chirstian', '1986-12-01', '010-1670-1769'),
(004, 'Kyoichi', '1989-09-12', '010-1073-1055'),
(005, 'Anneke', '1989-06-02', '010-0751-1643'),
(006, 'Tzvetan', '1989-02-10', '010-7968-5182'),
(007, 'Saniya', '1994-09-15', '010-1678-6107'),
(008, 'Sumant', '1985-02-18', '010-1867-1079'),
(009, 'Duangkaew', '1989-08-24', '010-1546-1749'),
(010, 'Patricio', '1992-12-18', '010-0124-9180'),
(011, 'Mary', '1990-01-22', '010-4172-6197'),
(012, 'Eberhardt', '1985-10-20', '010-1469-8145'),
(013, 'Berni', '1987-03-11', '010-8093-0187'),
(014, 'Guoxiang', '1987-07-02', '010-9581-9412'),
(015, 'Kazuhito', '1995-01-27', '010-1607-4716'),
(016, 'Cristinel', '1993-08-03', '010-1860-7819'),
(017, 'Kazuhide', '1987-04-03', '010-2890-8794'),
(018, 'Lillian', '1999-04-30', '010-8590-6012');

insert into Realestate values
(000, 10000000, 22, '경기', '광주', '송정'),
(001, 13000000, 18, '경기', '광주', '경안'),
(002, 8000000, 45, '충북', '청주', '가경'),
(003, 16000000, 23, '강원', '강릉', '내곡'),
(004, 20000000, 11, '충북', '청주', '사창'),
(005, 15000000, 5, '전남', '광양', '광영'),
(006, 6000000, 33, '경북', '구미', '도량'),
(007, 22000000, 29, '충북', '청주', '복대'),
(008, 12000000, 15, '경북', '경주', '동천'),
(009, 10000000, 68, '전남', '광양', '태인'),
(010, 18000000, 28, '전북', '군산', '미룡');

insert into CMPEmployee values
(000, 'Gil', '사원', '2000000', 'enig58@gmail.com', 007),
(001, 'Aiichiro', '차장', '2800000', 'wefn2@gmail.com', null),
(002, 'Krisda', '과장', '3300000', 'eijy56@gmail.com', null),
(003, 'Bader', '차장', '2600000', 'bnxcm99@gmail.com', null),
(004, 'Berna', '사원', '2200000', 'enig58@gmail.com', 003),
(005, 'Ger', '사장', '5500000', 'gekr@gmail.com', null),
(006, 'Stella', '전무', '3800000', 'iuoiu245@gmail.com', null),
(007, 'Mingdong', '상무', '3500000', 'hoijxb@gmail.com', null),
(008, 'Martial', '차장', '2600000', 'hoj@gmail.com', null),
(009, 'Yuichiro', '사원', '1900000', 'oeiguoiw@gmail.com', 002),
(010, 'Tomokazu', '사원', '2300000', 'onijvoi@gmail.com', 016),
(011, 'Seongbae', '차장', '2500000', '3598gn@gmail.com', null),
(012, 'Weiru', '과장', '3600000', 'hoioih@gmail.com', null),
(013, 'Munenori', '대리', '2700000', 'goieoi4@gmail.com', 008),
(014, 'Susanna', '대리', '2600000', 'noijhoije@gmail.com', 012),
(015, 'Evgueni', '사원', '1900000', 'noijei367@gmail.com', 006),
(016, 'Kwangho', '차장', '2500000', 'gjhhh@gmail.com', null),
(017, 'Taegyun', '과장', '3400000', '869vjbj@gmail.com', null),
(018, 'Chiranjit', '사원', '2000000', 'glkjkl256@gmail.com', 001),
(019, 'Mark', '대리', '2500000', 'lijo4566@gmail.com', 017),
(020, 'Shao', '대리', '2600000', 'y86kje@gmail.com', 011);

insert into Branch values
()