use test;	/* test 데이터베이스 사용 */

DROP TABLE IF EXISTS department;
DROP TABLE IF EXISTS student;
DROP TABLE IF EXISTS professor;

CREATE TABLE department(
	dno INT NOT NULL,
    dname VARCHAR(20) NOT NULL,
    dean INT,
    PRIMARY KEY (dno)
);

INSERT INTO department VALUES 
(1, '소프트웨어', 100100),
(2, '경영', 100110),
(3, '전자', 100125),
(4, '전기', 100108),
(5, '통계', 100200),
(6, '교육', 100350);

CREATE TABLE professor(
	prof_id INT NOT NULL,
    prof_name VARCHAR(20) NOT NULL,
    prof_phone VARCHAR(30),
    prof_salary INT NOT NULL,
    prof_dept INT,
    PRIMARY KEY (prof_id)
);

INSERT INTO professor VALUES 
(100100, '구인영', 01057842139, 6000000, 1),
(100105, '강규희', 01077523944, 5000000, 1),
(100108, '서경배', 01044357710, 5500000, 4),
(100109, '여환준', 01059344953, 5300000, 4),
(100110, '유은규', 01059623496, 3500000, 2),
(100117, '박해련', 01086940398, 3000000, 2),
(100122, '천남준', 01038495293, 3800000, 2),
(100125, '이규진', 01069540384, 4200000, 3),
(100128, '마윤주', 01089494203, 4000000, 3),
(100200, '도성원', 01069843945, 3500000, 5),
(100220, '이보민', 01023185395, 5750000, 5),
(100280, '소규성', 01039852984, 4320000, 5),
(100350, '심진', 01048234955, 3700000, 6),
(100365, '변진일', 01023943956, 3250000, 6),
(100372, '김혜수', 01022324563, 3330000, 6);

CREATE TABLE student(
	std_id INT NOT NULL,
    std_name VARCHAR(20) NOT NULL,
    std_grade INT DEFAULT 1,
    std_age INT NOT NULL,
    std_dept INT,
    std_tutor INT,
    PRIMARY KEY (std_id)
);

INSERT INTO student VALUES
(2015046002, '서의섭', 3, 22, 1, 2014046029),
(2015046008, '손효민', 3, 22, 1, 2014046029),
(2014046029, '도민석', 4, 23, 1, null),
(2014046004, '강성호', 4, 23, 1, null),
(2016046001, '배민설', 2, 21, 1, 2015046002),
(2014044005, '구준혁', 4, 23, 2, null),
(2015044011, '김수전', 3, 22, 2, 2014044005),
(2016044055, '탁규호', 2, 21, 2, 2014044005),
(2016044057, '신민정', 2, 21, 2, 2014044005),
(2014048004, '심미성', 4, 23, 4, null),
(2017048011, '구민하', 1, 20, 4, 2014048004),
(2015055028, '한수중', 3, 22, 6, null),
(2017055020, '장수아', 1, 20, 6, 2015055028),
(2017055033, '구혜인', 1, 20, 6, 2015055028),
(2017055035, '유한별', 1, 20, 6, 2015055028),
(2017055038, '임주상', 1, 20, 6, 2015055028);

